Rails/art_share_api/app/controllers/artworks_controller.rb

    def destroy
        artwork = Artwork.find(params[:id])
        title = artwork.title
        if artwork.destroy
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 3]]