Rails/art_share_api/app/controllers/artwork_shares_controller.rb

SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 2]]
---
    def destroy
        artwork_share = ArtworkShare.find(params[:id])
        if artwork_share.destroy