Rails/art_share_api/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 3]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]
---
    def index
        case
        when params[:user_id]
          comments = Comment.where(user_id: params[:user_id])
        when params[:artwork_id]
          comments = Comment.where(artwork_id: params[:artwork_id])

INSERT INTO "comments" ("body", "user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "wow"], ["user_id", 3], ["artwork_id", 2], ["created_at", "2021-06-26 00:43:45.595371"], ["updated_at", "2021-06-26 00:43:45.595371"]]
---
    def create
        comment = Comment.new(comment_params)
        if comment.save