Rails/art_share_api/app/controllers/users_controller.rb

    def index
        if params[:query]
          users = User.where('username LIKE ?', "%#{params[:query]}%")
        else
          users = User.all
---
SELECT "users".* FROM "users" WHERE (username LIKE '%test%')

    def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "test3"], ["created_at", "2021-06-25 01:44:40.234722"], ["updated_at", "2021-06-25 01:44:40.234722"]]

    def update
        user = User.find(params[:id])

        if user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "test4"], ["updated_at", "2021-06-25 01:45:38.763963"], ["id", 3]]