SQL/URLShortener/app/models/shortened_url.rb

    def self.random_code()
        tmp = ""
        while tmp.empty? || ShortenedUrl.exists?(short_url: tmp)
---
SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "Lshm8AFo"], ["LIMIT", 1]]

    def self.create!(user, url)
        ShortenedUrl.create(long_url: url, user_id: user.id, short_url: ShortenedUrl.random_code)
---
INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_url", "XTD8b_nB"], ["long_url", "http://google.com"], ["user_id", 1], ["created_at", "2021-06-14 00:48:33.667451"], ["updated_at", "2021-06-14 00:48:33.667451"]]
INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_url", "Lshm8AFo"], ["long_url", "http://youtube.com/moopoke"], ["user_id", 1], ["created_at", "2021-06-14 03:39:33.220317"], ["updated_at", "2021-06-14 03:39:33.220317"]]

    def no_spamming
        last_minute = ShortenedUrl
        .where('created_at >= ?', 1.minute.ago)
        .where(user_id: user_id).count
---
SELECT COUNT(*) FROM "shortened_urls" WHERE (created_at >= '2021-06-14 03:38:33.219136') AND "shortened_urls"."user_id" = $1  [["user_id", 1]]

    def self.prune(n)
        ShortenedUrl.left_joins(:visits)
            .where('visits.created_at < ? OR
            (visits.id IS NULL AND shortened_urls.created_at < ?)',
            n.hours.ago, n.hours.ago).distinct.destroy_all
---
DELETE FROM "shortened_urls" WHERE "shortened_urls"."id" = $1  [["id", 2]]
DELETE FROM "visits" WHERE "visits"."id" = $1  [["id", 4]]
SELECT "visits".* FROM "visits" WHERE "visits"."shortened_url_id" = $1  [["shortened_url_id", 2]]